In [2]:
import numpy as np
import pandas as pd

In [ ]:
dates = pd.date_range(start='2025-01-01', end='2025-12-31', freq='D')
time_series = pd.Series(dates)
time_series

0     2025-01-01
1     2025-01-02
2     2025-01-03
3     2025-01-04
4     2025-01-05
         ...
360   2025-12-27
361   2025-12-28
362   2025-12-29
363   2025-12-30
364   2025-12-31
Length: 365, dtype: datetime64[ns]

In [8]:
time_series = pd.Series(pd.date_range(start='2025-01', end='2025-12', freq='MS'))
time_series

0    2025-01-01
1    2025-02-01
2    2025-03-01
3    2025-04-01
4    2025-05-01
5    2025-06-01
6    2025-07-01
7    2025-08-01
8    2025-09-01
9    2025-10-01
10   2025-11-01
11   2025-12-01
dtype: datetime64[ns]

In [9]:
ts = pd.Timestamp('2025-03-12')
ts

Timestamp('2025-03-12 00:00:00')

In [12]:
ts = pd.Timestamp('2024-12-04, 13:26')
ts

Timestamp('2024-12-04 13:26:00')

In [13]:
ts.year

2024

In [16]:
ts.minute

26

In [17]:
ts = pd.Timestamp('2025-04-22, 18:32', tz='UTC')
ts

Timestamp('2025-04-22 18:32:00+0000', tz='UTC')

In [20]:
ts.tz_convert('US/Eastern')

Timestamp('2025-04-22 14:32:00-0400', tz='US/Eastern')

In [34]:
dates = pd.date_range(start='2025-01-01', freq='D', periods=5)
time_series = pd.Series(dates, index=np.arange(1, len(dates)+1))
time_series

1   2025-01-01
2   2025-01-02
3   2025-01-03
4   2025-01-04
5   2025-01-05
dtype: datetime64[ns]

In [3]:
test_dates = pd.date_range(start='2025-05-01', periods=5, freq='D')
month_1_tests_df = pd.DataFrame({
    'Patient_ID': [1, 2, 3, 4, 5],
    'Test Date': test_dates,
    'Test Type': ['A', 'B', 'A', 'C', 'B'],
    'Result': ['P', 'High', 'N', 2.3, 'Normal']
}, index=np.arange(1, len(test_dates)+1))

month_1_tests_df

   Patient_ID  Test Date Test Type  Result
1           1 2025-05-01         A       P
2           2 2025-05-02         B    High
3           3 2025-05-03         A       N
4           4 2025-05-04         C     2.3
5           5 2025-05-05         B  Normal

In [75]:
date_strings = ['2024-01-04', '2025/03/03', '20250422 18:32', '2025-05-15 13:26:56']
pd.to_datetime(date_strings, format='mixed')

DatetimeIndex(['2024-01-04 00:00:00', '2025-03-03 00:00:00',
               '2025-04-22 18:32:00', '2025-05-15 13:26:56'],
              dtype='datetime64[ns]', freq=None)

In [76]:
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05'],
              dtype='datetime64[ns]', freq='D')

In [79]:
time_series.dt.strftime('%m/%d/%Y')

1    01/01/2025
2    01/02/2025
3    01/03/2025
4    01/04/2025
5    01/05/2025
dtype: object

In [81]:
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05'],
              dtype='datetime64[ns]', freq='D')

In [84]:
import locale

locale.setlocale(locale.LC_TIME, '')

'C.UTF-8'

In [85]:
email_df = pd.read_csv('/home/mseifoori/Machine-Learning-Exercises/people-10000.csv')
email_df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,5f10e9D33fC5f2b,Sara,Mcguire,Female,tsharp@example.net,(971)643-6089x9160,1921-08-17,"Editor, commissioning"
1,2,751cD1cbF77e005,Alisha,Hebert,Male,vincentgarrett@example.net,+1-114-355-1841x78347,1969-06-28,Broadcast engineer
2,3,DcEFDB2D2e62bF9,Gwendolyn,Sheppard,Male,mercadojonathan@example.com,9017807728,1915-09-25,Industrial buyer
3,4,C88661E02EEDA9e,Kristine,Mccann,Female,lindsay55@example.com,+1-607-333-9911x59088,1978-07-27,Multimedia specialist
4,5,fafF1aBDebaB2a6,Bobby,Pittman,Female,blevinsmorgan@example.com,3739847538,1989-11-17,Planning and development surveyor
...,...,...,...,...,...,...,...,...,...
9995,9996,D66F0e4EdFc35e6,Tina,Sherman,Male,bartlettcolleen@example.org,(455)476-4044x5755,1974-07-28,"Scientist, physiological"
9996,9997,c753d8B9F5b6054,Earl,Jennings,Female,andreabenton@example.com,009.056.6505,1932-08-20,Warehouse manager
9997,9998,Fb2c7daAdD82dAE,Ellen,Dominguez,Female,michaelayoder@example.net,409-428-4297x469,1966-06-06,Lawyer
9998,9999,34D88Ffc743Ca5B,Emma,Clark,Male,pstrickland@example.com,849-868-8653,1907-05-09,Accounting technician
9999,10000,82D540ce0BE556f,Katrina,Schwartz,Female,andres56@example.org,001-874-330-5546x16770,1935-08-14,Drilling engineer

In [99]:
email_df['Date of birth'] = email_df['Date of birth'].astype('datetime64[s]')

In [100]:
email_df['Date of birth']

0      1921-08-17
1      1969-06-28
2      1915-09-25
3      1978-07-27
4      1989-11-17
          ...
9995   1974-07-28
9996   1932-08-20
9997   1966-06-06
9998   1907-05-09
9999   1935-08-14
Name: Date of birth, Length: 10000, dtype: datetime64[s]

In [102]:
email_df['Date of birth'] =  email_df['Date of birth'].dt.strftime('%Y/%m/%d')

In [103]:
email_df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,5f10e9D33fC5f2b,Sara,Mcguire,Female,tsharp@example.net,(971)643-6089x9160,1921/08/17,"Editor, commissioning"
1,2,751cD1cbF77e005,Alisha,Hebert,Male,vincentgarrett@example.net,+1-114-355-1841x78347,1969/06/28,Broadcast engineer
2,3,DcEFDB2D2e62bF9,Gwendolyn,Sheppard,Male,mercadojonathan@example.com,9017807728,1915/09/25,Industrial buyer
3,4,C88661E02EEDA9e,Kristine,Mccann,Female,lindsay55@example.com,+1-607-333-9911x59088,1978/07/27,Multimedia specialist
4,5,fafF1aBDebaB2a6,Bobby,Pittman,Female,blevinsmorgan@example.com,3739847538,1989/11/17,Planning and development surveyor
...,...,...,...,...,...,...,...,...,...
9995,9996,D66F0e4EdFc35e6,Tina,Sherman,Male,bartlettcolleen@example.org,(455)476-4044x5755,1974/07/28,"Scientist, physiological"
9996,9997,c753d8B9F5b6054,Earl,Jennings,Female,andreabenton@example.com,009.056.6505,1932/08/20,Warehouse manager
9997,9998,Fb2c7daAdD82dAE,Ellen,Dominguez,Female,michaelayoder@example.net,409-428-4297x469,1966/06/06,Lawyer
9998,9999,34D88Ffc743Ca5B,Emma,Clark,Male,pstrickland@example.com,849-868-8653,1907/05/09,Accounting technician
9999,10000,82D540ce0BE556f,Katrina,Schwartz,Female,andres56@example.org,001-874-330-5546x16770,1935/08/14,Drilling engineer

In [105]:
email_df['Date of birth'] = email_df['Date of birth'].astype('datetime64[s]')

In [107]:
email_df['Date of birth'].dt.tz_localize('UTC')

0      1921-08-17 00:00:00+00:00
1      1969-06-28 00:00:00+00:00
2      1915-09-25 00:00:00+00:00
3      1978-07-27 00:00:00+00:00
4      1989-11-17 00:00:00+00:00
                  ...
9995   1974-07-28 00:00:00+00:00
9996   1932-08-20 00:00:00+00:00
9997   1966-06-06 00:00:00+00:00
9998   1907-05-09 00:00:00+00:00
9999   1935-08-14 00:00:00+00:00
Name: Date of birth, Length: 10000, dtype: datetime64[s, UTC]